import React from 'react';

export const BODY = (FAQLink) => (
  <div>
    <h1>اوبن ملتي بلاير</h1>
    <p>
      هو عباره عن مود ملتي بلاير تحت الانشاء للعبه <em>جراند ثفت أوتو: سان أندرياس</em> و سوف تتوافق مع مود الملتي بلاير الحالي <em>سان اندريس ملتي بلاير</em>
    </p>
    <br />
    <p>
      هذا يعني ان <strong>مستخدمين سامب و اصحاب السرفرات و الاسكربتات يمكنهم اللعب علي اوبن ام بي بدون مشاكل</strong> و سوف يتوافر بعض التحسينات و التصحيلات بدون اي تغيرات
    </p>
    <p>
      اذا تريد ان تعرف موعد الاصدار او تريد المساعده فعليك الذهاب الي <a href="https://www.burgershot.gg/showthread.php?tid=99">هذا الرابط</a> لمعرفة معلومات اكثر. اذا تريد ان تعرف موعد الاصدار او تريد المساعده فعليك الذهاب الي <a href="https://www.burgershot.gg/showthread.php?tid=99">هذا الرابط</a> لمعرفة معلومات اكثر. اذا تريد ان تعرف موعد الاصدار او تريد المساعده فعليك الذهاب الي <a href="https://www.burgershot.gg/showthread.php?tid=99">هذا الرابط</a> لمعرفة معلومات اكثر.
    </p>
    <h1>
      <FAQLink>اسئله و اجوبه</FAQLink>
    </h1>
  </div>
);

export const FAQ = () => (
  <div>
    <h1>اسئله و اجوبه</h1>
    <hr />
    <h2>ما هو اوبن ام بي؟</h2>
    <p>اوبن ام بي (اوبن ملتي بلاير) هو مود ملتي بلاير احطياطي لعبه سان اندريس حيث انها تحل مشاكل سامب و تعمل مع السرفرات فقط و يمكن للعبين سامب اللعب علي هذا المود و سوف يتوافر كلينت قريبا</p>
    <hr />
    <h2>هل هذا تقليد؟</h2>
    <p>لا حيث انه من الصفر ولكن يوجد بعض المشاكل الصعبه:</p>
    <ol>
      <li>يوجد بعض من كود سامب لدعم السرفرات</li>
      <li>حيت ان لا نريد اجبار اصحاب السرفر و اللعبين علي هذه التغيرات</li>
    </ol>
    <hr />
    <h2>لماذا تفعلون هذا؟</h2>
    <p>بغد النظر عن المحولات لمساعده سامب و لاكن صاحب سامب لا يريد المساعده مننا و لا يريد ان يسمع الي اراء اللعبين</p>
    <br />
    <p>نحن نرفض</p>
    <hr />
    <h2>هل سيكون المود المصدر المفتوح؟</h2>
    <p>تبقا لخططنا فالاجابه نعم ولكن علينا ان نتأكد انه جاهز</p>
    <hr />
    <h2>كيف اساعدكم؟</h2>
    <p>يمكنكم متباعه الصفحه الأتيه علي موقع برجر شوت لتعرفوا المزيد عن هذا الموضوع</p>
    <br />
    <a href="https://www.burgershot.gg/showthread.php?tid=99">
      <u>"كيف اساعدكم" صفحه</u>
    </a>
    <hr />
    <h2>ما هو موقع برجر شوت؟</h2>
    <p>هو موقع منتدي للتواصل مع الناس حيث انه لا يوجد علاقه بينهم و انهم لا يملكون الموقع الرسمي او المنتدي الخاص للمود</p>
    <hr />
    <h2>ماذا عن اوبن ملتي بروسيسنج؟</h2>
    <p>هذا شي و هذا شي اخر حيث لا يوجد علاقه لالملتي بروسيسنج</p>
  </div>
);
