import React from 'react';

export const BODY = (FAQLink) => (
  <div>
    <h1>Open Multiplayer</h1>
    <p>
    მომავალი multiplayer მოდიფიკაცია თამაშისთვის - <em>Grand Theft Auto: San Andreas</em> - რომელიც იქნება უკუთავსებადი ერთ-ერთ, ამჟამინდელ მოდიფიკაციასთან <br /><em>San Andreas Multiplayer.</em>
    </p>
    <br />
    <p>
    ეს ნიშნავს რომ <strong>მიმდინარე SA:MP კლიენტი და მისი არსებული სკრიპტები, უპრობლემოდ იმუშავებს open.mp-ზეც</strong>. <br />ამასთანავე ბევრი ბაგი იქნება გასწორებული სასერვერო პროგრამაშივე. შესაბამისად აღარ მოგიწევთ დამატებითი პროგრამების გამოყენება.
    </p>
    <p>
    გაინტერესებთ როდისა არის დაგეგმილი პირველი საჯარო გამოშვება ან გსურთ დაეხმაროთ პროექტს? - დამატებითი ინფორმაციისთვის წაიკითხეთ: <a href="https://www.burgershot.gg/showthread.php?tid=99">ეს სტატია</a>.
    </p>
    <h1>
      <FAQLink>FAQ</FAQLink>
    </h1>
  </div>
);

export const FAQ = () => (
  <div>
    <h1>FAQ</h1>
    <hr />
    <h2>რა არის open.mp?</h2>
    <p>open.mp (Open Multiplayer) არის ერთ-ერთი მოდიფიკაცია San Andreas-ის თვის, რომლის შექმნის ინიციატივა, გამოიწვია პრობლემების ზრდამ: განახლებებსა და მენეჯმენთზე SA-MP-ში. პირველი ვერსია იქნება გამოშვებული სასერვერო პროგრამის შესაცვლელად. ამჟამინდელი SA-MP-ის კლიენტით, შესაძლებელი იქნება ამავე სერვერზე დაკავშირება. მომავალში კი open.mp-ის კლიენტი იქნება ხელმისაწვდომი, რომელიც მეტ შესაძლებლობებს შემოგვთავაზებს.</p>
    <hr />
    <h2>არის თუ არა ეს განშტოება?</h2>
    <p>არა. ეს არის კოდის აბსოლუტურად ხელახლა გადაწერა, დიდხნიანი ცოდნისა და გამოცდილების გამოყენებით.<br /> უკვე იყო SA:MP განშტოებების შექმნის მცდელობები, მაგრამ ჩვენ გვჯერა რომ მათ ქონდათ ორი ძირითადი პრობლემა:</p>
    <ol>
      <li>ისინი დაფუძნებული იყვნენ "გაჟონილი" SA-MP ის კოდზე. ამ მოდიფიკაციების ავტორებს არ ჰქონდათ ამ კოდით სარგებლობის უფლება და ისინი მორალურადაც და ლეგალურადაც ყოველთვის უკანა ფლანგზე იყვნენ.<br /> ჩვენ რა თქმა უნდა უარს ვამბობთ ამ კოდის გამოყენებაზე. ეს ოდნავ აფერხებს განვითარების სისწრაფეს მაგრამ ეს სწორი ნაბიჯია სტაბილურად გასაშვებად.</li>
      <br /><li>მათ სცადეს თავიდან გამოეგონებინათ ძალიან ბევრი რამ ერთ ჯერზე: სკრიპტინიგ ძრავის შეცვლა, შესაძლებლობების მოშორება სხვა შესაძლებლობების დამატებისას, სხვადასხვა რაღაცების ერთმანეთთან შეუთავსებლად დაკავშირება. ეს იწვევს იმ სერვერების განვითარების შეფერხებას, რომელსაც დიდი რაოდენობის მოთამაშეები და კარგად დამუშავებული სათამაშო სკრიპტი აქვს, მათ მოუწევდათ თავიდან დაეწერათ ბევრი რამ. ჩვენ სერიოზულად ვაპირებთ დავამატოთ ბევრი ახალი რამ, მაგრამ ჩვენ ასევე ვზრუნავთ მიმდინარე სერვერებზე, მათ ვუწყობთ ხელს რომ გამოიყენონ ჩვენი კოდი თავიანთი კოდის შეცვლის გარეშე.</li>
    </ol>
    <hr />
    <h2>რატომ ვაკეთებთ ჩვენ ამას?</h2>
    <p>მიუხედავად დიდი მცდელობებისა SA-MP ის დეველოფმენთში ოფიციალურად ჩართვისა სხვადასხვა ფორმებით: რჩევებით,  ვინმეზე რამის თხოვნით და შეთავაზებებით ბეტა ტესტერის პოზიციაზე; ასევე მოთამაშეებისგან სიახლეების მოთხოვნით.. მაგრამ ჩვენ არანაირი პროგრესი არ დაგვინახავს. ეს ყოველივე მიჩნეული იყო როგორც ინტერესის დაკარგვა ამ მოდის გაუმჯობესებაში, რაც თავისმხრივ პრობლემა არაა, მაგრამ არც წარმატებაა. იმის მაგივრად რომ განვითარება გაგრძელებულიყო თუნდაც იმ ხალხის მიერ ვისაც ეს უნდოდა, დამაარებელს სურდა მიექცია ყურადღება, აერთებდა სხვადასხვა საქმეებს მინიმალური შედეგის მისაღებად. ზოგი ფიქრობს რომ ეს დაბალი შემოსავლის ბრალია, მაგრამ ამის არანაირი მტკიცებულება არ არსებობს. მიუხედავად დიდი ინტერესისა და მზარდი მოთამაშეების რიცხვისა, მას ჯეროდა რომ მხოლოდ 1 ან 2 წელი ჰქონდა დარჩენილი ამ მოდს, და ის საზოგადოება რომელმაც წვლილი ჩადო გაეხადა SA-MP ი ის, რაც დღეს არის, არ იმსახურებდა ამ საქმის გაგრძელებას.</p>
    <br />
    <p>ჩვენ არ ვეთანხმებით.</p>
    <hr />
    <h2>რა არის თქვენი აზრი კალკორის/SA:MP/სხვა რამის შესახებ?</h2>
    <p>ჩვენ გვიყვარს SA:MP-ი - ეს არის ჩვენი აქ ყოფნის პირველი მიზეზი და ჩვენ ვალში ვართ Kalcor-თან მისი შექმნისთვის. მას დიდი ღვაწლი მიუძღვის წლების მანძილზე ამ მოდისთვის, და ეს ღვაწლი არ უნდა იყოს დავიწყებული ან/და დაიგნორებული. ქმედებები, რომლებიც მიუძღვის open.mp-ს წინ, გამოწვეულია იმის გამო რომ ჩვენ არ ვეთანხმებით მის რამდენიმე გადაწყვეტილებას და ასევე მის ერთსა და იმავე მცდელობას, რომელიც მოდიფიკაციის არასწორი მიმართულებით წაყვანას ცდილობს - ეს მცდელობები კი პრობლემებს არ ჭრის. ამის გამო ჩვენ ვალდებულები ვართ რომ მივიღოთ ასეთი გადაწყვეტილება და განვაგრძოთ SA-MP-ი Kalcor-ის გარეშე. ჩვენი ეს ქმედება არ მიღებული პირადი მიზნებისთვის, და არც არავინ არ უნდა მიიღოს როგორც შეურაცხყოფად. </p>
    <hr />
    <h2>არ არის ეს საზოგადოების გაყოფა?</h2>
    <p>ეს არ არის ჩვენი მიზანი. ჩვენი იდეების თანახმად ეს არ მომხმარებლების გაყოფა, მაგრამ რაღაციდან გამოცალკევება და სხვა რამის გადარჩენა უკეთესია ვიდრე არაფერი. ფაქტის თანახმად, ვინაიდან ამ მოდს ჰყავს დიდი რაოდენობით არა ინგლუსურ ენოვანი მომხმარებელი, მათ მაინც მიიღს ინგლისურ ენოვანი მომხმარებლების საზოგადოება. მომხმარებლები ნელ-ნელა იყოფოდნენ ერთმანეთისგან და მაშასადამე ჩვენი იდეა იმაშიც მდგომარეობს რომ ისევ გავაერთიანოთ მოთამაშეები და დავაბრუნოთ მათი ერთობა. დიდი რაოდენობით ადამიანი იყო დაბლოკილი ოფიციალური SA-MP-ის ფორუმიდან ( და რამდენიმე შემთხვევაში, მათი პოსტებისა და კომენტარების ისტორია იქნა წაშლილი), მაგრამ Kalcor-მა განაცხადა რომ SA-MP-ის ოფიციალური ფორუმი არ არის SA-MP-ი, და არც მისი ნაწილი. ბევრი მოთამაშეს და სერვერის მფლობელებს, არ აქვთ დაპოსტილი ამ ფორუმზე, უფრო მეტიც - არ არიან დარეგისტრირებული ფორუმზე.</p>
    <hr />
    <h2>ვინაიდან და რადგანაც ის არის "Open" Multiplayer, იქნება თუ არა მისი კოდი ყველასათვის ხელმისაწვდომი?</h2>
    <p>ჩვენი პასუხი არის - კი, მაგრამ ამჟამად ჩვენ ვცდილობთ დავამყაროთ ღია კომუნიკაცია და გამჭირვალობა დეველოპმენტის შესახებ (რომელიც უკვე გამოუმჯობესებაა)</p>
    <hr />
    <h2>როდის გაეშვება?</h2>
    <p>ეს საკმაოდ რთული შეკითხვაა, რომელსაც ერთი, თუმცა არასრული პასუხი აქვს: როდესაც მზად იქნება. არ არსებობს გზა, რომელიც მიგვითითებს თუ რამდენი ხანი დასჭირდება მსგავსი პროექტის დასრულებას.<br />პროექტი დიდი ხანია რაც მუშაობის პროცესშია და მისი აქტივობა სამწუხაროდ ცვალებადია, ამის ფაქტორი კი იმ ხალხის შეზღუდული თავისუფალი დრო გახლავთ, რომლებიც პროექტზე მუშაობენ.<br />თუმცა აღსანიშნავია რომ პროექტი სწრაფად პროგრესირებს, გარკვეული მიზეზების გამო (რომლებზეც დეტალურად მომავალში ვისაუბრებთ).</p>
    <hr />
    <h2>როგორ შეგიძლია დაგვეხმარო?</h2>
    <p>თვალი ადევნე ფორუმს. ჩვენ გვაქვს გახსნილი სტატია ამ თემაზე, რომელსაც ვხდით აქტიურს მაშინვე, როდესაც მეტი ფუნქციონალი იქნება ხელმისაწვდომი. <br />მიუხედავად იმისა, რომ პროექტი დაგეგმიზლე ადრე გამჟღავნდა, ჩვენ უკვე ახლოს ვართ საწყის გამოშვებასთან, მაგრამ, ეს არ ნიშავს რომ მეტი დახმარება არ დაფასდება. მადლობა წინასწარ ამ პროექტში დაინტერესებისთვის და იმედის ქონისთვის:</p>
    <br />
    <a href="https://www.burgershot.gg/showthread.php?tid=99">
      <u>სტატია - "How to help" (burgershot.gg)</u>
    </a>
    <hr />
    <h2>რა არის burgershot.gg?</h2>
    <p>burgershot.gg არის გეიმინგ ფორუმი, სხვა არაფერი. ბევრი ადამიანი არის ჩართული ორივე პროექტში და გარკვეული open.mp-ს განვითარება-განახლება, იპოსტება იქ, მაგრამ, ეს ორი სხვადასხვა დამოუკიდებელი პროექტია. burgershot.gg არ არის OMP ფორუმი, არც OMP არის burgershot-ის საკუთრება, როდესაც OMP საიტი სრულად გაეშვება, ეს ორიც განთავისუფლდება ერთმანეთისგან (SA-MP-იც დაჰოსტილი იყო GTAForums მიერ სანამ საკუთარ საიტს გაუშვებდა).</p>
    <hr />
    <h2>რას ვფიქრობთ OpenMP -ზე?</h2>
    <p>Open Multi-Processing პროექტი არის "OpenMP", ჩვენ ვართ "open.mp". აბსოლუტურად განსხვავებული.</p>
  </div>
);
